:PROPERTIES:
:ID:       db5e5ed5-987b-428a-a402-c267c09cf0c4
:CREATED:  2024-05-26T22:57:08
:END:
#+title: Implementing algebraic effects through typeclass prolog
#+LANGUAGE: english
#+PROPERTY: header-args :exports code
#+date: <2024-05-29 Wed>

Monads are a popular way to model effects in purely functional programming
languages, but they come with problems. For instance, to compose them(and
compose their effects), we have to use [[https://en.wikipedia.org/wiki/Monad_transformer][Monad transformers]]. An alternative that
has started to emerge is algebraic effects. Algebraic effects are composable and
one could see them as a type safe incarnation of delimited continuations. We
used delimited continuations to implement ~async~ and ~await~ syntax in [[id:bc6ba032-8b50-4403-95db-abb7da96ae83][the last
post]]. Here, however, we will try to derive a useful usage for algebraic
effects pattern through the use of typeclass metaprogramming and lots of haskell
extensions.

* COMMENT To play with the code, tangle this org document

If you use emacs, you can tangle the whole org document, open the haskell file
and type =C-c C-l=: everything typechecks!

#+begin_src emacs-lisp
(org-babel-tangle-file (buffer-file-name)
                       "typeclass-prolog-for-algebraic-effects.hs"
                       "haskell")
#+end_src

#+RESULTS:
| /home/terramorpha/org-roam/blog/typeclass-prolog-for-algebraic-effects.hs |

